Revit 2026 API

# RebarSpliceShiftOption Enumeration

---

Describes the way bars are shifted in the splice relation.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RebarSpliceShiftOption
```
```vb
Public Enumeration RebarSpliceShiftOption
```
```cpp
public enum class RebarSpliceShiftOption
```
```fsharp
type RebarSpliceShiftOption
```

| Member name | Value | Description |
| --- | --- | --- |
| BarPlane | 0 | Bar Plane is shifted so that the spliced rebars are not clashing. |
| None | 1 | The bars are not shifted at all. |

#### Reference

Autodesk.Revit.DB.Structure Namespace